ivanmeler/android_kernel_samsung_herolte/drivers/input/keyboard/cypress/cy8cmbr_swd.c
/*
 *
 *
 */
#include "cy8cmbr_swd.h"

/*****************************************************************************
 *
 *****************************************************************************/
struct swd_data {
	struct touchkey_i2c *swd_tkey_i2c;
	struct device *dev;
	int (*power) (void *, bool on);
	int swdio_gpio;
	int swdck_gpio;
	const u8 *fw_img;
	size_t fw_img_size;
};
static struct swd_data _swd_data;
static struct swd_data *g_sd = NULL;

/*****************************************************************************
 * SWD
 *****************************************************************************/
/* Macros for SWD Physical layer functions */
#define swd_set_swdck_out(sd)	gpio_direction_output(sd->swdck_gpio, 0)
#define swd_set_swdck_hi(sd)	gpio_set_value(sd->swdck_gpio, 1)
#define swd_set_swdck_lo(sd)	gpio_set_value(sd->swdck_gpio, 0)

#define swd_set_swdio_out(sd)	gpio_direction_output(sd->swdio_gpio, 0)
#define swd_set_swdio_in(sd)	gpio_direction_input(sd->swdio_gpio)
#define swd_set_swdio_hi(sd)	gpio_set_value(sd->swdio_gpio, 1)
#define swd_set_swdio_lo(sd)	gpio_set_value(sd->swdio_gpio, 0)
#define swd_get_swdio(sd)	gpio_get_value(sd->swdio_gpio)

/*****************************************************************************
 * AN84858
 *
 *
 *
 *
 *****************************************************************************/
#include "SWD_UpperPacketLayer.h"
#include "SWD_PacketLayer.h"

//#define HEX_FIRMWARE
#define FORCE_PROTECT

#define CY8C40xx_FAMILY				1

/******************************************************************************
 *   Timeout
 ******************************************************************************/
#define DEVICE_ACQUIRE_TIMEOUT_US		50000
#define SROM_POLLING_TIMEOUT_MS			1000

/******************************************************************************
 *   Hex
 ******************************************************************************/
/* The below definitions are not dependent on hex file and are always
   constant */

#if (CY8C40xx_FAMILY)
#define BYTES_PER_FLASH_ROW			64
#else
#define BYTES_PER_FLASH_ROW			128
#endif
#define SILICON_ID_BYTE_LENGTH			4
#define CHECKSUM_BYTE_LENGTH			2
#define MAXIMUM_ROW_PROTECTION_BYTE_LENGTH	32
#ifndef HEX_FIRMWARE
#define NUMBER_OF_FLASH_ROWS_HEX_FILE		128
#endif
#ifdef HEX_FIRMWARE
#include "HexImage.h"
static void HEX_ReadSiliconId(u32 * hexSiliconId)
{
	u8 i;

	for (i = 0; i < SILICON_ID_BYTE_LENGTH; i++) {
		*hexSiliconId =
			*hexSiliconId | ((u32) (deviceSiliconId_HexFile[i]) <<
					(8 * i));
	}
}

static void HEX_ReadRowData(u16 rowCount, u8 * rowData)
{
	u16 i;			/* Maximum value of 'i' can be 256 */

	for (i = 0; i < BYTES_PER_FLASH_ROW; i++) {
		rowData[i] = flashData_HexFile[rowCount][i];
	}
}

static void HEX_ReadChipProtectionData(u8 * chipProtectionData)
{
	*chipProtectionData = chipProtectionData_HexFile;
}

static void HEX_ReadRowProtectionData(u8 rowProtectionByteSize,
		u8 * rowProtectionData)
{
	u16 i;

	for (i = 0; i < rowProtectionByteSize; i++) {
		rowProtectionData[i] = flashProtectionData_HexFile[i];
	}
}

static void HEX_ReadChecksumData(u16 * checksumData)
{
	u8 i;

	for (i = 0; i < CHECKSUM_BYTE_LENGTH; i++) {
		*checksumData |= (checksumData_HexFile[i] << (8 * i));
	}
}
#endif //HEX_FIRMWARE
static u16 GetFlashRowCount(void)
{
	return (NUMBER_OF_FLASH_ROWS_HEX_FILE);
}

/******************************************************************************
 *   Programming Steps
 ******************************************************************************/
/* Return value definitions for high level Programming functions */
#define FAILURE 0
#define SUCCESS (!FAILURE)

/* Return value of PollSromStatus function */
#define SROM_SUCCESS 0x01

/* Error codes returned by Swd_PacketAck whenever any top-level step returns a
   failure status */

/* This bit field is set if programmer fails to acquire the device in 1.5 ms */
#define PORT_ACQUIRE_TIMEOUT_ERROR	0x10

/* This bit field is set if the SROM does not return the success status code
   within the SROM Polling timeout duration*/
#define SROM_TIMEOUT_ERROR		0x20

/* This bit field is set in case of JTAG ID mismatch or Flash data verification
   mismatch or Checksum data mismatch */
#define VERIFICATION_ERROR			0x40

/* This bit field is set if wrong transition of chip protection settings is
   detected */
#define TRANSITION_ERROR			0x80

/* Constants for Address Space of CPU */
#if (CY8C40xx_FAMILY)
#define CPUSS_SYSREQ	            0x40100004
#define CPUSS_SYSARG	            0x40100008
#else
#define CPUSS_SYSREQ	            0x40000004
#define CPUSS_SYSARG	            0x40000008
#endif
#define TEST_MODE	                0x40030014
#define SRAM_PARAMS_BASE	        0x20000100
#define SFLASH_MACRO	            0x0FFFF000
#define SFLASH_CPUSS_PROTECTION	    0x0FFFF07C

/* SROM Constants */
#define SROM_KEY1	                0xB6
#define SROM_KEY2	                0xD3
#define SROM_SYSREQ_BIT	            0x80000000
#define SROM_PRIVILEGED_BIT	        0x10000000
#define SROM_STATUS_SUCCEEDED	    0xA0000000
#define SROM_STATUS_FAILED	        0xF0000000

/* SROM Commands */
#define SROM_CMD_GET_SILICON_ID	    0x00
#define SROM_CMD_LOAD_LATCH	        0x04
#define SROM_CMD_PROGRAM_ROW	    0x06
#define SROM_CMD_ERASE_ALL	        0x0A
#define SROM_CMD_CHECKSUM	        0x0B
#define SROM_CMD_WRITE_PROTECTION	0x0D
#if (CY8C40xx_FAMILY)
#define SROM_CMD_SET_IMO_48MHZ		0x15
#endif

/* Chip Level Protection */
#define CHIP_PROT_VIRGIN	        0x00
#define CHIP_PROT_OPEN	            0x01
#define CHIP_PROT_PROTECTED	        0x02
#define CHIP_PROT_KILL	            0x04

/* Mask for status code returned by polling SROM */
#define SROM_STATUS_SUCCESS_MASK	0xF0000000

/* Constant for computing checksum of entire flash */
#define CHECKSUM_ENTIRE_FLASH		0x8000

/* Constant DAP ID of ARM Cortex M0 CPU */
#define CM0_DAP_ID					0x0BB11477

/* Constant maximum number of rows in PSoC 4 */
#define ROWS_PER_ARRAY				256

static u32 checksum_Privileged = 0;
static u32 statusCode = 0;

static u8 result = 0;
#if defined(HEX_FIRMWARE) || defined(FORCE_PROTECT)
static u8 chipProtectionData_Chip = 0;
#endif
static u8 randompara = 0;

static enum Transition_mode { OPEN_XXX, VIRGIN_OPEN, PROT_XXX,
	WRONG_TRANSITION } flow;

