ivanmeler/android_kernel_samsung_herolte/drivers/input/keyboard/cypress/cy8cmbr_swd.c
#if defined(FORCE_PROTECT)
static void HEX_ReadChipProtectionData(u8 * chipProtectionData)
{
	*chipProtectionData = CHIP_PROT_OPEN;
}

static void HEX_ReadRowProtectionData(u8 rowProtectionByteSize, u8 * rowProtectionData)
{
	u16 i;

	for(i = 0; i < rowProtectionByteSize; i++)
		rowProtectionData[i] = 0xFF;
}
#endif

static u8 PollSromStatus(void)
{
	unsigned long end_time;

	end_time = jiffies + msecs_to_jiffies(SROM_POLLING_TIMEOUT_MS);
	do {
		/* Read CPUSS_SYSREQ register and check if SROM_SYSREQ_BIT and
		   SROM_PRIVILEGED_BIT are reset to 0 */
		Read_IO(CPUSS_SYSREQ, &statusCode);

		statusCode &= (SROM_SYSREQ_BIT | SROM_PRIVILEGED_BIT);
	} while ((statusCode != 0) && time_before_eq(jiffies, end_time));

	randompara = 10;
	/* If time exceeds the timeout value, set the SROM_TIMEOUT_ERROR bit in
	   swd_PacketAck */
	if (!time_before_eq(jiffies, end_time)) {
		swd_PacketAck = swd_PacketAck | SROM_TIMEOUT_ERROR;

		Read_IO(CPUSS_SYSARG, &statusCode);

		return (FAILURE);
	}
	randompara = 12;
	/* Read CPUSS_SYSARG register to check if the SROM command executed
	   successfully else set SROM_TIMEOUT_ERROR in swd_PacketAck */
	Read_IO(CPUSS_SYSARG, &statusCode);

	if ((statusCode & SROM_STATUS_SUCCESS_MASK) != SROM_STATUS_SUCCEEDED) {
		swd_PacketAck = swd_PacketAck | SROM_TIMEOUT_ERROR;
		randompara = 14;
		return (FAILURE);
	} else {
		return (SUCCESS);
	}
}

#if (CY8C40xx_FAMILY)
static void SetIMO48MHz(void)
{
	u32 parameter1 = 0;

	/* Load the Parameter1 with the SROM command to read silicon ID */
	parameter1 = (u32) (((u32) SROM_KEY1 << 0) +	//
			(((u32) SROM_KEY2 +
			  (u32) SROM_CMD_SET_IMO_48MHZ) << 8));

	/* Write the command to CPUSS_SYSARG register */
	Write_IO(CPUSS_SYSARG, parameter1);
	Write_IO(CPUSS_SYSREQ, SROM_SYSREQ_BIT | SROM_CMD_SET_IMO_48MHZ);
}

#endif

#ifdef HEX_FIRMWARE
static u8 GetChipProtectionVal(void)
{
	u32 parameter1 = 0;
	u32 chipProtData = 0;

	/* Load the Parameter1 with the SROM command to read silicon ID */
	parameter1 = (u32) (((u32) SROM_KEY1 << 0) +	//
			(((u32) SROM_KEY2 +
			  (u32) SROM_CMD_GET_SILICON_ID) << 8));

	/* Write the command to CPUSS_SYSARG register */
	Write_IO(CPUSS_SYSARG, parameter1);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Request system call by writing to CPUSS_SYSREQ register */
	Write_IO(CPUSS_SYSREQ, SROM_SYSREQ_BIT | SROM_CMD_GET_SILICON_ID);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Read status of the operation */
	result = PollSromStatus();

	if (result != SROM_SUCCESS) {
		return (FAILURE);
	}

	/* Read CPUSS_SYSREQ register to get the current protection setting of the
	   chip */
	Read_IO(CPUSS_SYSREQ, &chipProtData);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	chipProtectionData_Chip = (u8) (chipProtData >> 12);
	input_info(true, g_sd->dev, "%s: chipProtectionData_Chip=%d\n", __func__,
			chipProtectionData_Chip);
	return (SUCCESS);
}

static u8 GetTransitionMode(void)
{
	u8 chipProtectionData_Hex;

	/* Get the chip protection setting in the HEX file */
	HEX_ReadChipProtectionData(&chipProtectionData_Hex);

	/* enum variable flow stores the transition (current protection setting to
	   setting in hex file) of the chip */
	flow = WRONG_TRANSITION;

	input_info(true, g_sd->dev, "%s: chipProtectionData_Chip=%s\n", __func__,
			chipProtectionData_Chip ==
			CHIP_PROT_VIRGIN ? "CHIP_PROT_VIRGIN" : chipProtectionData_Chip
			==
			CHIP_PROT_OPEN ? "CHIP_PROT_OPEN" : chipProtectionData_Chip ==
			CHIP_PROT_PROTECTED ? "CHIP_PROT_PROTECTED" : "ELSE");
	switch (chipProtectionData_Chip) {
		/* virgin to open protection setting is the only allowed transition */
	case CHIP_PROT_VIRGIN:
		if (chipProtectionData_Hex == CHIP_PROT_OPEN)
			flow = VIRGIN_OPEN;
		else
			flow = WRONG_TRANSITION;
		break;

		/* All transitions from Open are allowed other than transition to virgin
		   mode */
	case CHIP_PROT_OPEN:
		if (chipProtectionData_Hex == CHIP_PROT_VIRGIN)
			flow = WRONG_TRANSITION;
		else
			flow = OPEN_XXX;
		break;

		/* Protected to Protected and Protected to Open are the allowed
		   transitions */
	case CHIP_PROT_PROTECTED:
		if ((chipProtectionData_Hex == CHIP_PROT_OPEN)
				|| (chipProtectionData_Hex == CHIP_PROT_PROTECTED))
			flow = PROT_XXX;
		else
			flow = WRONG_TRANSITION;
		break;

	default:
		flow = WRONG_TRANSITION;
		break;
	}

	/* Set TRANSITION_ERROR bit high in Swd_PacketAck to show wrong transition
	   error */
	if (flow == WRONG_TRANSITION) {
		swd_PacketAck = swd_PacketAck | TRANSITION_ERROR;
		return (FAILURE);
	}
	input_info(true, g_sd->dev, "%s: flow=%s\n", __func__,
			flow == OPEN_XXX ? "OPEN_XXX" :
			flow == VIRGIN_OPEN ? "VIRGIN_OPEN" :
			flow == PROT_XXX ? "PROT_XXX" :
			flow == WRONG_TRANSITION ? "WRONG_TRANSITION" : "");
	return (SUCCESS);
}
#endif //HEX_FIRMWARE

static u8 LoadLatch(u8 arrayID, u8 * rowData)
{
	u32 parameter1 = 0;
	u32 parameter2 = 0;
	u8 i = 0;

	/* Load parameter1 with the SROM command to load the page latch buffer
	   with programming data */
	parameter1 = ((u32) SROM_KEY1 << 0) +	//
		(((u32) SROM_KEY2 + (u32) SROM_CMD_LOAD_LATCH) << 8) +	//
		(0x00 << 16) + ((u32) arrayID << 24);

	/* Number of Bytes to load minus 1 */
	parameter2 = (BYTES_PER_FLASH_ROW - 1);

	/* Write parameter1 in SRAM */
	Write_IO(SRAM_PARAMS_BASE + 0x00, parameter1);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Write parameter2 in SRAM */
	Write_IO(SRAM_PARAMS_BASE + 0x04, parameter2);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Put row data into SRAM buffer */
	for (i = 0; i < BYTES_PER_FLASH_ROW; i += 4) {
		parameter1 =
			(rowData[i] << 0) + (rowData[i + 1] << 8) +
			(rowData[i + 2] << 16) + (rowData[i + 3] << 24);

		/* Write parameter1 in SRAM */
		Write_IO(SRAM_PARAMS_BASE + 0x08 + i, parameter1);

		if (swd_PacketAck != SWD_OK_ACK) {
			return (FAILURE);
		}

	}

	/*  Call "Load Latch" SROM API */

	/* Set location of parameters */
	Write_IO(CPUSS_SYSARG, SRAM_PARAMS_BASE);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Request SROM operation */
	Write_IO(CPUSS_SYSREQ, SROM_SYSREQ_BIT | SROM_CMD_LOAD_LATCH);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

