ivanmeler/android_kernel_samsung_herolte/drivers/input/keyboard/cypress/cy8cmbr_swd.c
	/* Read status of the operation */
	result = PollSromStatus();

	if (result != SROM_SUCCESS) {
		return (FAILURE);
	}
	return (SUCCESS);
}

#if defined(HEX_FIRMWARE) || defined(FORCE_PROTECT)
static u8 LoadLatch_protect(u8 arrayID, u8 * rowData, u8 rowProtectionByteSize)
{
	u32 parameter1 = 0;
	u32 parameter2 = 0;
	u8 i = 0;

	/* Load parameter1 with the SROM command to load the page latch buffer
	   with programming data */
	parameter1 = ((u32) SROM_KEY1 << 0) +	//
		(((u32) SROM_KEY2 + (u32) SROM_CMD_LOAD_LATCH) << 8) +	//
		(0x00 << 16) + ((u32) arrayID << 24);

	/* Number of Bytes to load minus 1 */
	parameter2 = (rowProtectionByteSize - 1);

	/* Write parameter1 in SRAM */
	Write_IO(SRAM_PARAMS_BASE + 0x00, parameter1);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Write parameter2 in SRAM */
	Write_IO(SRAM_PARAMS_BASE + 0x04, parameter2);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Put row data into SRAM buffer */
	for (i = 0; i < rowProtectionByteSize; i += 4) {
		parameter1 =
			(rowData[i] << 0) + (rowData[i + 1] << 8) +
			(rowData[i + 2] << 16) + (rowData[i + 3] << 24);

		/* Write parameter1 in SRAM */
		Write_IO(SRAM_PARAMS_BASE + 0x08 + i, parameter1);

		if (swd_PacketAck != SWD_OK_ACK) {
			return (FAILURE);
		}

	}

	/*  Call "Load Latch" SROM API */

	/* Set location of parameters */
	Write_IO(CPUSS_SYSARG, SRAM_PARAMS_BASE);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Request SROM operation */
	Write_IO(CPUSS_SYSREQ, SROM_SYSREQ_BIT | SROM_CMD_LOAD_LATCH);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Read status of the operation */
	result = PollSromStatus();

	if (result != SROM_SUCCESS) {
		return (FAILURE);
	}
	return (SUCCESS);
}
#endif //HEX_FIRMWARE

static u8 ChecksumAPI(u16 checksumRow, u32 * checksum)
{
	u32 parameter1 = 0;
	u32 checksum_chip = 0;

	/* Load parameter1 with the SROM command to compute checksum of whole
	   flash */
	parameter1 = ((u32) SROM_KEY1 << 00) +
			(((u32) SROM_KEY2 + (u32) SROM_CMD_CHECKSUM) << 8) +
			(((u32) checksumRow & 0x000000FF) << 16) +
			(((u32) checksumRow & 0x0000FF00) << 16);

	/* Load CPUSS_SYSARG register with parameter1 command */
	Write_IO(CPUSS_SYSARG, parameter1);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Request SROM operation */
	Write_IO(CPUSS_SYSREQ, SROM_SYSREQ_BIT | SROM_CMD_CHECKSUM);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Read status of the operation */
	result = PollSromStatus();

	if (result != SROM_SUCCESS) {
		return (FAILURE);
	}

	/* Read CPUSS_SYSARG register to get the checksum value */
	Read_IO(CPUSS_SYSARG, &checksum_chip);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* 28-bit checksum */
	*checksum = (checksum_chip & 0x0FFFFFFF);

	return (SUCCESS);
}

#define SetXresHigh()		g_sd->power(g_sd->swd_tkey_i2c, 1)
#define SetXresLow()		g_sd->power(g_sd->swd_tkey_i2c, 0)
static u8 DeviceAcquire(void)
{
	u32 chip_DAP_Id = 0;
	u16 total_packet_count = 0;
	u32 status = 0;
	unsigned long end_time;
	struct swd_data *sd = g_sd;

	input_dbg(true, g_sd->dev, "%s: \n", __func__);
	/* Aquiring Sequence */

	/* Set SWDIO and SWDCK initial pin directions and out values */
	swd_set_swdio_out(sd);
	swd_set_swdio_lo(sd);
	swd_set_swdck_out(sd);
	swd_set_swdck_lo(sd);

	/* Set XRES of PSoC 4 low for 100us with SWDCK and SWDIO low (min delay
	   required is 5us) */
	SetXresLow();
	msleep(100);	//DelayHundredUs();
	SetXresHigh();

	end_time = jiffies + usecs_to_jiffies(DEVICE_ACQUIRE_TIMEOUT_US);
	do {
		/* Call Swd_LineReset (Standard ARM command to reset DAP) and read
		   DAP_ID from chip */
		Swd_LineReset();

		Read_DAP(DPACC_DP_IDCODE_READ, &chip_DAP_Id);

		total_packet_count++;

	} while ((swd_PacketAck != SWD_OK_ACK)
			&& time_before_eq(jiffies, end_time));

	/* Set PORT_ACQUIRE_TIMEOUT_ERROR bit in swd_PacketAck if time
	   exceeds 1.5 ms */
	if (!time_before_eq(jiffies, end_time)) {
		swd_PacketAck = swd_PacketAck | PORT_ACQUIRE_TIMEOUT_ERROR;
		input_err(true, g_sd->dev, "%s: fail, swd_PacketAck=0x%02x \n",
				__func__, swd_PacketAck);
		goto testmode_fail;	//return(FAILURE);
	}
	input_info(true, g_sd->dev, "%s: chip_DAP_Id=0x%08x \n", __func__, chip_DAP_Id);

	/* Set VERIFICATION_ERROR bit in swd_PacketAck if the DAP_ID read
	   from chip does not match with the ARM CM0_DAP_ID (MACRO defined in
	   ProgrammingSteps.h file - 0x0BB11477) */
	if (chip_DAP_Id != CM0_DAP_ID) {
		swd_PacketAck = swd_PacketAck | VERIFICATION_ERROR;
		input_dbg(true, g_sd->dev, "%s:%d: chip_DAP_Id:%x\n", __func__, __LINE__, chip_DAP_Id);
		goto testmode_fail;	//return(FAILURE);
	}

	/* Initialize Debug Port */
	Write_DAP(DPACC_DP_CTRLSTAT_WRITE, 0x54000000);

	if (swd_PacketAck != SWD_OK_ACK) {
		input_dbg(true, g_sd->dev, "%s:%d: swd_PacketAck:%x\n", __func__, __LINE__, swd_PacketAck);
		goto testmode_fail;	//return(FAILURE);
	}

	Write_DAP(DPACC_DP_SELECT_WRITE, 0x00000000);

	if (swd_PacketAck != SWD_OK_ACK) {
		input_dbg(true, g_sd->dev, "%s:%d: swd_PacketAck:%x\n", __func__, __LINE__, swd_PacketAck);
		goto testmode_fail;	//return(FAILURE);
	}

	Write_DAP(DPACC_AP_CSW_WRITE, 0x00000002);

	if (swd_PacketAck != SWD_OK_ACK) {
		input_dbg(true, g_sd->dev, "%s:%d: swd_PacketAck:%x\n", __func__, __LINE__, swd_PacketAck);
		goto testmode_fail;	//return(FAILURE);
	}

	/* Enter CPU into Test Mode */
	Write_IO(TEST_MODE, 0x80000000);

	if (swd_PacketAck != SWD_OK_ACK) {
		input_dbg(true, g_sd->dev, "%s:%d: swd_PacketAck:%x\n", __func__, __LINE__, swd_PacketAck);
		goto testmode_fail;	//return(FAILURE);
	}

	Read_IO(TEST_MODE, &status);

	if (swd_PacketAck != SWD_OK_ACK) {
		input_dbg(true, g_sd->dev, "%s:%d: swd_PacketAck:%x\n", __func__, __LINE__, swd_PacketAck);
		goto testmode_fail;	//return(FAILURE);
	}

	if ((status & 0x80000000) != 0x80000000) {
		input_dbg(true, g_sd->dev, "%s:%d: status:%x\n", __func__, __LINE__, status);
		goto testmode_fail;	//return (FAILURE);
	}

	/* Read status of the operation */
	result = PollSromStatus();

