ivanmeler/android_kernel_samsung_herolte/drivers/input/keyboard/cypress/cy8cmbr_swd.c
	if (result != SROM_SUCCESS) {
		input_dbg(true, g_sd->dev, "%s:%d: result:%x\n", __func__, __LINE__, result);
		goto testmode_fail;	//return(FAILURE);
	}

#if (CY8C40xx_FAMILY)
	/* Set IMO to 48 MHz */
	SetIMO48MHz();

	/* Read status of the operation */
	result = PollSromStatus();

	if (result != SROM_SUCCESS) {
		input_err(true, g_sd->dev, "%s:%d: fail result:%x\n", __func__, __LINE__, result);
		return (FAILURE);
	}
#endif
	input_info(true, g_sd->dev, "%s: success\n", __func__);
	return (SUCCESS);

testmode_fail:
	return (FAILURE);
}

#ifdef HEX_FIRMWARE
static u8 VerifySiliconId(void)
{
	u32 deviceSiliconID;
	u32 hexSiliconId = 0;

	u32 parameter1 = 0;
	u32 siliconIdData1 = 0;
	u32 siliconIdData2 = 0;

	input_info(true, g_sd->dev, "%s: \n", __func__);

	/* Read and store Silicon ID from HEX file to hexSiliconId array */
	HEX_ReadSiliconId(&hexSiliconId);

	/* Load Parameter1 with the SROM command to read silicon ID from PSoC 4
	   chip */
	parameter1 = (u32) (((u32) SROM_KEY1 << 0) +	//
			(((u32) SROM_KEY2 +
			  (u32) SROM_CMD_GET_SILICON_ID) << 8));

	/* Load CPUSS_SYSARG register with parameter1 */
	Write_IO(CPUSS_SYSARG, parameter1);
	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Request SROM operation */
	Write_IO(CPUSS_SYSREQ, SROM_SYSREQ_BIT | SROM_CMD_GET_SILICON_ID);
	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Read status of the operation */
	result = PollSromStatus();
	if (result != SROM_SUCCESS) {
		return (FAILURE);
	}

	/* Read CPUSS_SYSARG and CPUSS_SYSREQ to read 4 bytes of silicon ID */
	Read_IO(CPUSS_SYSARG, &siliconIdData1);
	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	Read_IO(CPUSS_SYSREQ, &siliconIdData2);
	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/*
	   SiliconIdData2 (0th byte) = 4th byte of Device Silicon ID (MSB)
	   SiliconIdData1 (3rd byte) = 3rd byte of Device Silicon ID
	   SiliconIdData1 (1st byte) = 2nd byte of Device Silicon ID
	   SiliconIdData1 (2nd byte) = 1st byte of Device Silicon ID (LSB)
	 */
	deviceSiliconID = (((siliconIdData2 << 24) & 0xFF000000) + (siliconIdData1 & 0x00FF0000) +	//
			((siliconIdData1 << 8) & 0x0000FF00) +
			((siliconIdData1 >> 8) & 0x000000FF));
	input_dbg(true, g_sd->dev, "%s: deviceSiliconID=0x%08x\n", __func__,
			deviceSiliconID);
	input_dbg(true, g_sd->dev, "%s: hexSiliconId=0x%08x\n", __func__,
			hexSiliconId);
	input_info(true, g_sd->dev, "%s: success\n", __func__);
	return (SUCCESS);
}
#endif //HEX_FIRMWARE

static u8 EraseAllFlash(void)
{
	u32 parameter1 = 0;

	input_dbg(true, g_sd->dev, "%s: \n", __func__);

#ifdef HEX_FIRMWARE
	/* Get current chip protection setting */
	GetChipProtectionVal();

	/* Check if the Chip protection setting transition is valid */
	result = GetTransitionMode();
	if (result != SUCCESS) {
		return (FAILURE);
	}
#else
	flow = OPEN_XXX;
#endif
	/* If the transition is from open to any protection setting or from virgin to
	   open, call ERASE_ALL SROM command */
	if ((flow == OPEN_XXX) || (flow == VIRGIN_OPEN)) {
		parameter1 = (u32) (((u32) SROM_KEY1 << 0) +	//
				(((u32) SROM_KEY2 +
				  (u32) SROM_CMD_ERASE_ALL) << 8));

		/* Load ERASE_ALL SROM command in parameter1 to SRAM */
		Write_IO(SRAM_PARAMS_BASE + 0x00, parameter1);
		if (swd_PacketAck != SWD_OK_ACK) {
			return (FAILURE);
		}

		/* Set location of parameters */
		Write_IO(CPUSS_SYSARG, SRAM_PARAMS_BASE);
		if (swd_PacketAck != SWD_OK_ACK) {
			return (FAILURE);
		}

		/* Request SROM call */
		Write_IO(CPUSS_SYSREQ, SROM_SYSREQ_BIT | SROM_CMD_ERASE_ALL);
		if (swd_PacketAck != SWD_OK_ACK) {
			return (FAILURE);
		}

		/* Read status of the operation */
		result = PollSromStatus();
		if (result != SUCCESS) {
			return (FAILURE);
		}
		input_info(true, g_sd->dev, "%s: erase all succeeded\n", __func__);
	}

	/* If the transition is from protected mode to open mode or protected mode to
	   protected mode only, call ERASE_ALL SROM command */
	else if (flow == PROT_XXX) {
		/* Move chip to open state: 0x01 corresponds to open state, 0x00 to
		   macro 1 */
		parameter1 = ((u32) SROM_KEY1 << 0) +	//
			(((u32) SROM_KEY2 + (u32) SROM_CMD_WRITE_PROTECTION) << 8) +	//
			(0x01 << 16) + (0x00 << 24);

		/* Load the write protection command to SRAM */
		Write_IO(CPUSS_SYSARG, parameter1);
		if (swd_PacketAck != SWD_OK_ACK) {
			return (FAILURE);
		}

		/* Request SROM call */
		Write_IO(CPUSS_SYSREQ,
				SROM_SYSREQ_BIT | SROM_CMD_WRITE_PROTECTION);
		if (swd_PacketAck != SWD_OK_ACK) {
			return (FAILURE);
		}

		/* Read status of the operation */
		result = PollSromStatus();
		if (result != SUCCESS) {
			return (FAILURE);
		}

		/* Re-acquire chip in OPEN mode */
		result = DeviceAcquire();
		if (result != SUCCESS) {
			return (FAILURE);
		}
		input_info(true, g_sd->dev, "%s: move to open state succeeded\n",
				__func__);
	}

	input_dbg(true, g_sd->dev, "%s: success\n", __func__);
	return (SUCCESS);
}

static u8 ChecksumPrivileged(void)
{
	input_dbg(true, g_sd->dev, "%s: \n", __func__);
	result = ChecksumAPI(CHECKSUM_ENTIRE_FLASH, &checksum_Privileged);
	if (result != SUCCESS) {
		return (FAILURE);
	}
	input_info(true, g_sd->dev, "%s: checksum_Privileged=0x%08x\n", __func__,
			checksum_Privileged);
	input_dbg(true, g_sd->dev, "%s: success\n", __func__);
	return (SUCCESS);
}

static u8 ProgramFlash(void)
{
	u8 arrayID = 0;
	u8 rowData[BYTES_PER_FLASH_ROW];

	u16 numOfFlashRows = 0;
	u16 rowCount = 0;

	u32 parameter1 = 0;

	input_info(true, g_sd->dev, "%s: \n", __func__);

	/* Get the total number of flash rows in the Target PSoC 4 device */
	numOfFlashRows = GetFlashRowCount();
	input_dbg(true, g_sd->dev, "%s: numOfFlashRows=%d\n", __func__,
			numOfFlashRows);

	/* Program all flash rows */
	for (rowCount = 0; rowCount < numOfFlashRows; rowCount++) {
#ifdef HEX_FIRMWARE
		HEX_ReadRowData(rowCount, &rowData[0]);
#else
		memcpy(&rowData[0],
				g_sd->fw_img + (rowCount * BYTES_PER_FLASH_ROW),
				BYTES_PER_FLASH_ROW);
#endif
		if (rowCount == 0)
			input_dbg(true, g_sd->dev,
					"%s: row%d file=0x%02x 0x%02x 0x%02x 0x%02x\n",
					__func__, rowCount, rowData[0], rowData[1],
					rowData[2], rowData[3]);
		else if (rowCount == (numOfFlashRows - 1))
			input_dbg(true, g_sd->dev,
					"%s: row%d file=0x%02x 0x%02x 0x%02x 0x%02x\n",
					__func__, rowCount, rowData[0], rowData[1],
					rowData[2], rowData[3]);

