ivanmeler/android_kernel_samsung_herolte/drivers/input/keyboard/cypress/cy8cmbr_swd.c
		arrayID = rowCount / ROWS_PER_ARRAY;

		result = LoadLatch(arrayID, &rowData[0]);

		if (result != SUCCESS) {
			input_err(true, g_sd->dev, "%s: fail load latch\n", __func__);
			return (FAILURE);
		}

		/* Load parameter1 with Program Row - SROM command */
		parameter1 = (u32) (((u32) SROM_KEY1 << 0) +
				(((u32) SROM_KEY2 +
				  (u32) SROM_CMD_PROGRAM_ROW) << 8) +
				(((u32) rowCount & 0x000000FF) << 16) +
				(((u32) rowCount & 0x0000FF00) << 16));

		/* Write parameters in SRAM */
		Write_IO(SRAM_PARAMS_BASE + 0x00, parameter1);

		if (swd_PacketAck != SWD_OK_ACK) {
			input_err(true, g_sd->dev, "%s: fail prog row\n", __func__);
			return (FAILURE);
		}

		/* Set location of parameters */
		Write_IO(CPUSS_SYSARG, SRAM_PARAMS_BASE);

		if (swd_PacketAck != SWD_OK_ACK) {
			input_err(true, g_sd->dev, "%s: fail set location\n", __func__);
			return (FAILURE);
		}

		/* Request SROM operation */
		Write_IO(CPUSS_SYSREQ, SROM_SYSREQ_BIT | SROM_CMD_PROGRAM_ROW);

		if (swd_PacketAck != SWD_OK_ACK) {
			input_err(true, g_sd->dev, "%s: fail request SROM operation\n",
					__func__);
			return (FAILURE);
		}

		/* Read status of the operation */
		result = PollSromStatus();

		if (result != SROM_SUCCESS) {
			input_err(true, g_sd->dev, "%s: fail read status\n", __func__);
			return (FAILURE);
		}

	}

	input_info(true, g_sd->dev, "%s: success\n", __func__);
	return (SUCCESS);
}

static u8 VerifyFlash(void)
{
	u32 flashData = 0;
	u16 numOfFlashRows = 0;
	u16 rowAddress = 0;
	u16 rowCount;
	u8 i;
	u8 rowData[BYTES_PER_FLASH_ROW];
	u8 chipdata[BYTES_PER_FLASH_ROW];

	input_dbg(true, g_sd->dev, "%s: \n", __func__);

	/* Get the total number of flash rows in the Target PSoC 4 device */
	numOfFlashRows = GetFlashRowCount();
	input_info(true, g_sd->dev, "%s: numOfFlashRows=%d\n", __func__,
			numOfFlashRows);

	/* Read and Verify Flash rows */
	for (rowCount = 0; rowCount < numOfFlashRows; rowCount++) {
		/* Read row from hex file */

		/* linear address of row in flash */
		rowAddress = BYTES_PER_FLASH_ROW * rowCount;

		/* Extract 128-byte row from the hex-file from address: ?�rowCount??into
		   buffer - ?�rowData?? */
#ifdef HEX_FIRMWARE
		HEX_ReadRowData(rowCount, &rowData[0]);
#else
		memcpy(&rowData[0],
				g_sd->fw_img + (rowCount * BYTES_PER_FLASH_ROW),
				BYTES_PER_FLASH_ROW);
#endif

		if (rowCount == 0)
			input_dbg(true, g_sd->dev,
					"%s: row%d file=0x%02x 0x%02x 0x%02x 0x%02x\n",
					__func__, rowCount, rowData[0], rowData[1],
					rowData[2], rowData[3]);
		else if (rowCount == (numOfFlashRows - 1))
			input_dbg(true, g_sd->dev,
					"%s: row%d file=0x%02x 0x%02x 0x%02x 0x%02x\n",
					__func__, rowCount, rowData[0], rowData[1],
					rowData[2], rowData[3]);

		/* Read row from chip */
		for (i = 0; i < BYTES_PER_FLASH_ROW; i += 4) {
			/* Read flash via AHB-interface */
			Read_IO(rowAddress + i, &flashData);
			if (swd_PacketAck != SWD_OK_ACK) {
				return (FAILURE);
			}

			chipdata[i + 0] = (flashData >> 0) & 0xFF;
			chipdata[i + 1] = (flashData >> 8) & 0xFF;
			chipdata[i + 2] = (flashData >> 16) & 0xFF;
			chipdata[i + 3] = (flashData >> 24) & 0xFF;
		}
		if (rowCount == 0)
			input_dbg(true, g_sd->dev,
					"%s: row%d chip=0x%02x 0x%02x 0x%02x 0x%02x\n",
					__func__, rowCount, chipdata[0], chipdata[1],
					chipdata[2], chipdata[3]);

		else if (rowCount == (numOfFlashRows - 1))
			input_dbg(true, g_sd->dev,
					"%s: row%d chip=0x%02x 0x%02x 0x%02x 0x%02x\n",
					__func__, rowCount, chipdata[0], chipdata[1],
					chipdata[2], chipdata[3]);

		/* Compare the row data of HEX file with chip data */
		for (i = 0; i < BYTES_PER_FLASH_ROW; i++) {
			if (chipdata[i] != rowData[i]) {
				swd_PacketAck =
					swd_PacketAck | VERIFICATION_ERROR;
				return (FAILURE);
			}
		}
	}
	input_info(true, g_sd->dev, "%s: success\n", __func__);
	return (SUCCESS);
}

#if defined(HEX_FIRMWARE) || defined(FORCE_PROTECT)
static u8 ProgramProtectionSettings(void)
{
	u8 arrayID = 0;
	u8 rowProtectionByteSize = 0;
	u8 rowProtectionData[MAXIMUM_ROW_PROTECTION_BYTE_LENGTH];
	u8 chipProtectionData_Hex;

	u16 numOfFlashRows = 0;

	u32 parameter1 = 0;

	input_info(true, g_sd->dev, "%s: \n", __func__);

	/* Get total number of flash rows to determine the size of row protection data
	   and arrayID */
	numOfFlashRows = GetFlashRowCount();
	input_dbg(true, g_sd->dev, "%s: numOfFlashRows=%d\n", __func__,
			numOfFlashRows);

	rowProtectionByteSize = numOfFlashRows / 8;
	input_dbg(true, g_sd->dev, "%s: rowProtectionByteSize=%d\n", __func__,
			rowProtectionByteSize);

	arrayID = numOfFlashRows / ROWS_PER_ARRAY;
	input_dbg(true, g_sd->dev, "%s: arrayID=%d\n", __func__, arrayID);

	HEX_ReadChipProtectionData(&chipProtectionData_Hex);
	input_dbg(true, g_sd->dev, "%s: chipProtectionData=%d\n", __func__,
			chipProtectionData_Hex);

	HEX_ReadRowProtectionData(rowProtectionByteSize, &rowProtectionData[0]);
	input_dbg(true, g_sd->dev, "%s: rowProtectionData0~2:0x%02x 0x%02x 0x%02x \n",
			__func__, rowProtectionData[0], rowProtectionData[1],
			rowProtectionData[2]);

	/* Load protection setting of current macro into volatile latch using
	   LoadLatch API */
	result =
		LoadLatch_protect(arrayID, &rowProtectionData[0],
				rowProtectionByteSize);

	if (result != SUCCESS) {
		return (FAILURE);
	}

	/* Program protection setting into supervisory row */
	parameter1 = (u32) (((u32) SROM_KEY1 << 0) +	//
			(((u32) SROM_KEY2 + (u32) SROM_CMD_WRITE_PROTECTION) << 8) +	//
			((u32) chipProtectionData_Hex << 16));

	/* Load parameter1 in CPUSS_SYSARG register */
	Write_IO(CPUSS_SYSARG, parameter1);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Request SROM call */
	Write_IO(CPUSS_SYSREQ, SROM_SYSREQ_BIT | SROM_CMD_WRITE_PROTECTION);

	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	/* Read status of the operation */
	result = PollSromStatus();

	if (result != SROM_SUCCESS) {
		return (FAILURE);
	}

	input_info(true, g_sd->dev, "%s: success\n", __func__);
	return (SUCCESS);
}

static u8 VerifyProtectionSettings(void)
{
	u32 protectionData = 0;
	u32 flashProtectionAddress = 0;
	u16 numOfFlashRows = 0;
	u8 chipProtectionData_Hex = 0;
	u8 rowProtectionByteSize = 0;
	u8 i;
	u8 rowProtectionData[MAXIMUM_ROW_PROTECTION_BYTE_LENGTH];
	u8 rowProtectionFlashData[MAXIMUM_ROW_PROTECTION_BYTE_LENGTH];

	input_info(true, g_sd->dev, "%s: \n", __func__);

	numOfFlashRows = GetFlashRowCount();

	rowProtectionByteSize = numOfFlashRows / 8;
	input_dbg(true, g_sd->dev, "%s: rowProtectionByteSize=%d\n", __func__,
			rowProtectionByteSize);

