ivanmeler/android_kernel_samsung_herolte/drivers/input/keyboard/cypress/cy8cmbr_swd.c
	flashProtectionAddress = SFLASH_MACRO;

	/* Read Protection settings from hex-file */
	HEX_ReadRowProtectionData(rowProtectionByteSize, &rowProtectionData[0]);

	/* Read Protection settings from silicon */
	for (i = 0; i < rowProtectionByteSize; i += 4) {
		Read_IO(flashProtectionAddress + i, &protectionData);

		if (swd_PacketAck != SWD_OK_ACK) {
			return (FAILURE);
		}

		rowProtectionFlashData[i + 0] = (protectionData >> 0) & 0xFF;
		rowProtectionFlashData[i + 1] = (protectionData >> 8) & 0xFF;
		rowProtectionFlashData[i + 2] = (protectionData >> 16) & 0xFF;
		rowProtectionFlashData[i + 3] = (protectionData >> 24) & 0xFF;

		if (i == 0)
			input_dbg(true, g_sd->dev,
					"%s: rowProtectionFlashData0~2:0x%02x 0x%02x 0x%02x \n",
					__func__, rowProtectionData[0],
					rowProtectionData[1], rowProtectionData[2]);
	}

	/* Compare hex and silicon?�s data */
	for (i = 0; i < rowProtectionByteSize; i++) {
		if (rowProtectionData[i] != rowProtectionFlashData[i]) {
			/* Set the verification error bit for Flash protection data
			   mismatch and return failure */
			swd_PacketAck = swd_PacketAck | VERIFICATION_ERROR;
			return (FAILURE);
		}
	}

	/* Read Chip Level Protection from hex-file */
	HEX_ReadChipProtectionData(&chipProtectionData_Hex);
	input_dbg(true, g_sd->dev, "%s: chipProtectionData=%d\n", __func__,
			chipProtectionData_Hex);

	/* Read Chip Level Protection from the silicon */
	Read_IO(SFLASH_CPUSS_PROTECTION, &protectionData);
	if (swd_PacketAck != SWD_OK_ACK) {
		return (FAILURE);
	}

	chipProtectionData_Chip = (protectionData >> 24) & 0x0F;
	input_dbg(true, g_sd->dev, "%s: chipProtectionData_Chip=0x%02x\n", __func__,
			chipProtectionData_Chip);

	if (chipProtectionData_Chip == CHIP_PROT_VIRGIN) {
		chipProtectionData_Chip = CHIP_PROT_OPEN;
		//input_dbg(true, g_sd->dev, "%s: chip protection open\n", __func__);
	} else if (chipProtectionData_Chip == CHIP_PROT_OPEN) {
		chipProtectionData_Chip = CHIP_PROT_VIRGIN;
		//input_dbg(true, g_sd->dev, "%s: chip protection virgin\n", __func__);
	}

	/* Compare hex?�s and silicon?�s chip protection data */
	if (chipProtectionData_Chip != chipProtectionData_Hex) {
		/* Set the verification error bit for Flash protection data
		   mismatch and return failure */
		swd_PacketAck = swd_PacketAck | VERIFICATION_ERROR;
		return (FAILURE);
	}

	input_info(true, g_sd->dev, "%s: success\n", __func__);
	return (SUCCESS);
}
#endif

static u8 VerifyChecksum(void)
{
	u32 checksum_All = 0;
	u16 chip_Checksum = 0;

	input_info(true, g_sd->dev, "%s: \n", __func__);

	/* Read the checksum of entire flash */
	result = ChecksumAPI(CHECKSUM_ENTIRE_FLASH, &checksum_All);

	if (result != SUCCESS) {
		input_err(true, g_sd->dev, "%s: fail ChecksumAPI\n", __func__);
		return (FAILURE);
	}
	input_dbg(true, g_sd->dev, "%s: checksum of entire flash=0x%08x\n", __func__,
			checksum_All);

	/* Calculate checksum of user flash */
	chip_Checksum = (u16) checksum_All - (u16) checksum_Privileged;
	input_info(true, g_sd->dev, "%s: chip_Checksum=0x%08x\n", __func__,
			chip_Checksum);
	input_info(true, g_sd->dev, "%s: checksum from fw file=0x%08x\n", __func__,
			g_sd->swd_tkey_i2c->fw_img->checksum);

	/* Compare the checksum data of silicon and hex file */
	if (chip_Checksum != g_sd->swd_tkey_i2c->fw_img->checksum) {
		swd_PacketAck = swd_PacketAck | VERIFICATION_ERROR;
		input_err(true, g_sd->dev, "%s: fail compare checksum\n", __func__);
		return (FAILURE);
	}

	input_info(true, g_sd->dev, "%s: success\n", __func__);
	return (SUCCESS);
}

static void ExitProgrammingMode(void)
{
	input_info(true, g_sd->dev, "%s: \n", __func__);

	/* Generate active low rest pulse for 100 uS */
	SetXresLow();
	msleep(20);
	SetXresHigh();
}

static u8 ProgramDevice(struct swd_data *sd)
{
	if (DeviceAcquire() == FAILURE)
		goto fail;
#if !defined(CRC_CHECK_INTERNAL)
	if (sd->swd_tkey_i2c->do_checksum == true) {
		if (VerifyChecksum() == SUCCESS) {
			input_info(true, sd->dev, "%s: fw update pass\n", __func__);
			goto out;
		}
	}
#endif
#ifdef HEX_FIRMWARE
	if (VerifySiliconId() == FAILURE)
		goto fail;
#endif
	if (EraseAllFlash() == FAILURE)
		goto fail;

	if (ChecksumPrivileged() == FAILURE)
		goto fail;

	if (ProgramFlash() == FAILURE)
		goto fail;

	if (VerifyFlash() == FAILURE)
		goto fail;
#if defined(HEX_FIRMWARE) || defined(FORCE_PROTECT)
	if (ProgramProtectionSettings() == FAILURE)
		goto fail;

	if (VerifyProtectionSettings() == FAILURE)
		goto fail;
#endif
	if (VerifyChecksum() == FAILURE)
		goto fail;

#if !defined(CRC_CHECK_INTERNAL)
out:
#endif
	ExitProgrammingMode();
	/* All the steps were completed successfully */
	return (SUCCESS);
fail:
	ExitProgrammingMode();
	return (FAILURE);
}

/*****************************************************************************
 * probe
 *****************************************************************************/
int cy8cmbr_swd_program(struct touchkey_i2c *tkey_i2c)
{
	struct swd_data *sd;
	int rc;

	input_info(true, &tkey_i2c->client->dev, "%s: \n", __func__);

	memset(&_swd_data, 0, sizeof(_swd_data));
	sd = &_swd_data;
	sd->swd_tkey_i2c = tkey_i2c;
	sd->power = tkey_i2c->power;
	sd->swdio_gpio = tkey_i2c->dtdata->gpio_sda;
	sd->swdck_gpio = tkey_i2c->dtdata->gpio_scl;
	sd->fw_img = tkey_i2c->fw_img->data;
	sd->fw_img_size = tkey_i2c->fw_img->fw_len;
	sd->dev = &tkey_i2c->client->dev;
	g_sd = sd;

	Swd_configPhysical(sd->swdio_gpio, sd->swdck_gpio);
	if (ProgramDevice(sd) == SUCCESS)
		rc = 0;
	else
		rc = -1;

	input_info(true, &tkey_i2c->client->dev, "%s: end, rc=%d\n", __func__, rc);
	return rc;
}
